# Pandas

In [4]:
import pandas as pd

In [5]:
#first column is index 
#second column value
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [6]:
seri = pd.Series([10,88,3,4,5])
type(seri)

pandas.core.series.Series

In [7]:
#The index structure of the series is accessed.
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [8]:
seri.ndim

1

In [9]:
seri.dtype

dtype('int64')

In [10]:
seri.size

5

In [11]:
seri.values

array([10, 88,  3,  4,  5], dtype=int64)

In [12]:
#return the first 5 row
seri.head()

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [20]:
seri.head(3)

0    10
1    88
2     3
dtype: int64

In [13]:
#return the last 5 row
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [14]:
seri1 = pd.Series([99,23,76,2323,98], index = [1,3,5,7,9])
seri1

1      99
3      23
5      76
7    2323
9      98
dtype: int64

In [15]:
seri2 = pd.Series([99,23,76,2323,98], index = ["a","b","c","d","e"])
seri2

a      99
b      23
c      76
d    2323
e      98
dtype: int64

In [16]:
seri2["a"]

99

In [17]:
seri2["a":"c"]

a    99
b    23
c    76
dtype: int64

In [18]:
#Create a dictinary
dic1 = {"reg":10, "log":11,"cart":12}

In [19]:
series = pd.Series(dic1)

In [20]:
series

reg     10
log     11
cart    12
dtype: int64

In [21]:
#concatenation
pd.concat([series,series])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

# Indexing and Slicing

In [24]:
import numpy as np
a = np.array([1,2,33,444,75], dtype = "int64")
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int64

In [25]:
seri[0]

1

In [26]:
#slicing
seri[0:3]

0     1
1     2
2    33
dtype: int64

In [27]:
seri = pd.Series([121,200,150,99], index = ["reg","loj","cart","rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [29]:
#this method just uses to access indexes.
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [31]:
#this method just uses to access keys.
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [32]:
#it can be used like dictionary method.
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [33]:
seri.values

array([121, 200, 150,  99], dtype=int64)

In [34]:
"reg" in seri

True

In [35]:
"a" in seri

False

In [36]:
seri["reg"]

121

In [38]:
#fancy 
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [39]:
seri["reg"] = 130
seri["reg"]

130

In [40]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

In [41]:
seri["reg"] in seri

False

In [42]:
"reg" in seri

True

In [43]:
130 in seri.items()

False


# Creating DataFrame

In [44]:
#NumPy cannot keep categorical and numeric data together. That's why we need a Pandas.
import pandas as pd
l = [1,2,23,345,7,8,3]
l

[1, 2, 23, 345, 7, 8, 3]

In [50]:
pd.DataFrame(l,columns = ["degisken_isimleri"])

   degisken_isimleri
0                  1
1                  2
2                 23
3                345
4                  7
5                  8
6                  3

In [51]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [52]:
pd.DataFrame(m, columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [53]:
#dataframe renaming
df =pd.DataFrame(m, columns=["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [54]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [55]:
df.columns = ["deg1","deg2","deg3"]

In [56]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [57]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [58]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [59]:
df.describe()

       deg1  deg2  deg3
count   3.0   3.0   3.0
mean    4.0   5.0   6.0
std     3.0   3.0   3.0
min     1.0   2.0   3.0
25%     2.5   3.5   4.5
50%     4.0   5.0   6.0
75%     5.5   6.5   7.5
max     7.0   8.0   9.0

In [60]:
df.T

      0  1  2
deg1  1  4  7
deg2  2  5  8
deg3  3  6  9

In [61]:
type(df)

pandas.core.frame.DataFrame

In [62]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [63]:
df.shape

(3, 3)

In [64]:
df.ndim

2

In [65]:
df.size

9

In [66]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [67]:
type(df.values)

numpy.ndarray

In [68]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [69]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [70]:
a = np.array([1,2,3,4,5])
pd.DataFrame(a, columns =["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

In [87]:
import numpy as np
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [88]:
dic1 = {"var1":s1, "var2":s2, "var3":s3}
dic1

{'var1': array([1, 4, 4, 2, 0]),
 'var2': array([3, 1, 2, 6, 9]),
 'var3': array([7, 0, 5, 6, 2])}

In [89]:
df = pd.DataFrame(dic1)
df

   var1  var2  var3
0     1     3     7
1     4     1     0
2     4     2     5
3     2     6     6
4     0     9     2

In [90]:
df[0:1]

   var1  var2  var3
0     1     3     7

In [91]:
df[0:2]

   var1  var2  var3
0     1     3     7
1     4     1     0

In [92]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     1     3     7
b     4     1     0
c     4     2     5
d     2     6     6
e     0     9     2

In [93]:
df["c":"e"]

   var1  var2  var3
c     4     2     5
d     2     6     6
e     0     9     2

In [94]:
df.drop("a", axis = 0)

   var1  var2  var3
b     4     1     0
c     4     2     5
d     2     6     6
e     0     9     2

In [95]:
df

   var1  var2  var3
a     1     3     7
b     4     1     0
c     4     2     5
d     2     6     6
e     0     9     2

In [96]:
#inplace = If we make it true, the drop will be done permanently.
df.drop("a", axis = 0, inplace = True)

In [97]:
df

   var1  var2  var3
b     4     1     0
c     4     2     5
d     2     6     6
e     0     9     2

In [98]:
#fancy
l = {"c","e"}
df.drop(l, axis = 0)

   var1  var2  var3
b     4     1     0
d     2     6     6

In [99]:
"var1" in df

True

In [100]:
l = ["var1","var4","var2"]
for i in l:
    print(i in df)

True
False
True

In [102]:
l = ["var1","var2"]
df.drop(l, axis = 1)

   var3
b     0
c     5
d     6
e     2

# loc & iloc

In [103]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    26    22     3
1    15     5    22
2     6    13    26
3    23     5     2
4     7    10     3
5     8    12    24
6    28     1     7
7    17    23    22
8    29    19     4
9     6     3    13

In [105]:
df.loc[0:3]

   var1  var2  var3
0    26    22     3
1    15     5    22
2     6    13    26
3    23     5     2

In [106]:
df.iloc[0:3]

   var1  var2  var3
0    26    22     3
1    15     5    22
2     6    13    26

In [107]:
df.iloc[0,0]

26

In [108]:
df.iloc[:3,:2]

   var1  var2
0    26    22
1    15     5
2     6    13

In [109]:
df.loc[0:3,"var3"]

0     3
1    22
2    26
3     2
Name: var3, dtype: int32

In [110]:
df.iloc[0:3]["var3"]

0     3
1    22
2    26
Name: var3, dtype: int32

In [111]:
df[0:2]

   var1  var2  var3
0    26    22     3
1    15     5    22

In [112]:
df.iloc[0:2]

   var1  var2  var3
0    26    22     3
1    15     5    22

In [113]:
df.loc[0:2]

   var1  var2  var3
0    26    22     3
1    15     5    22
2     6    13    26

In [114]:
df.iloc[:,:2]

   var1  var2
0    26    22
1    15     5
2     6    13
3    23     5
4     7    10
5     8    12
6    28     1
7    17    23
8    29    19
9     6     3

In [115]:
df.iloc[:,0]

0    26
1    15
2     6
3    23
4     7
5     8
6    28
7    17
8    29
9     6
Name: var1, dtype: int32

In [116]:
df.loc[0:3,"var3"]

0     3
1    22
2    26
3     2
Name: var3, dtype: int32

In [117]:
df.iloc[0:3]["var3"]

0     3
1    22
2    26
Name: var3, dtype: int32

# Conditional Operations

In [119]:
df[0:2][["var1","var2"]]

   var1  var2
0    26    22
1    15     5

In [120]:
df.var1 > 15

0     True
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
9    False
Name: var1, dtype: bool

In [121]:
df[df.var1 > 15]["var2"]

0    22
3     5
6     1
7    23
8    19
Name: var2, dtype: int32

In [122]:
df[(df.var1 >10) & (df.var3 < 8)]

   var1  var2  var3
0    26    22     3
3    23     5     2
6    28     1     7
8    29    19     4

In [123]:
df.loc[(df.var1 >10),["var1","var2"]]

   var1  var2
0    26    22
1    15     5
3    23     5
6    28     1
7    17    23
8    29    19

In [124]:
df[(df.var1 >10)][["var1","var2"]]

   var1  var2
0    26    22
1    15     5
3    23     5
6    28     1
7    17    23
8    29    19

# Join

In [125]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df1 = pd.DataFrame(m, columns=["var1","var2","var3"])
df1

   var1  var2  var3
0     9    28    27
1     8    13    23
2     4    16    20
3    22    21     5
4     8    19    18
5    23     6    24
6    28    11    26
7    28     8     6
8     5     4    29
9    26    16     2

In [126]:
df2 = df1 + 99
df2

   var1  var2  var3
0   108   127   126
1   107   112   122
2   103   115   119
3   121   120   104
4   107   118   117
5   122   105   123
6   127   110   125
7   127   107   105
8   104   103   128
9   125   115   101

In [127]:
pd.concat([df1,df2])

   var1  var2  var3
0     9    28    27
1     8    13    23
2     4    16    20
3    22    21     5
4     8    19    18
5    23     6    24
6    28    11    26
7    28     8     6
8     5     4    29
9    26    16     2
0   108   127   126
1   107   112   122
2   103   115   119
3   121   120   104
4   107   118   117
5   122   105   123
6   127   110   125
7   127   107   105
8   104   103   128
9   125   115   101

In [128]:
pd.concat([df1,df2], ignore_index=True)

    var1  var2  var3
0      9    28    27
1      8    13    23
2      4    16    20
3     22    21     5
4      8    19    18
5     23     6    24
6     28    11    26
7     28     8     6
8      5     4    29
9     26    16     2
10   108   127   126
11   107   112   122
12   103   115   119
13   121   120   104
14   107   118   117
15   122   105   123
16   127   110   125
17   127   107   105
18   104   103   128
19   125   115   101

In [129]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [130]:
df2.columns = ["var1","var2","deg3"]
df2

   var1  var2  deg3
0   108   127   126
1   107   112   122
2   103   115   119
3   121   120   104
4   107   118   117
5   122   105   123
6   127   110   125
7   127   107   105
8   104   103   128
9   125   115   101

In [131]:
df1

   var1  var2  var3
0     9    28    27
1     8    13    23
2     4    16    20
3    22    21     5
4     8    19    18
5    23     6    24
6    28    11    26
7    28     8     6
8     5     4    29
9    26    16     2

In [132]:
df2

   var1  var2  deg3
0   108   127   126
1   107   112   122
2   103   115   119
3   121   120   104
4   107   118   117
5   122   105   123
6   127   110   125
7   127   107   105
8   104   103   128
9   125   115   101

In [133]:
pd.concat([df1,df2])

c:\users\omer\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN     9    28  27.0
1    NaN     8    13  23.0
2    NaN     4    16  20.0
3    NaN    22    21   5.0
4    NaN     8    19  18.0
5    NaN    23     6  24.0
6    NaN    28    11  26.0
7    NaN    28     8   6.0
8    NaN     5     4  29.0
9    NaN    26    16   2.0
0  126.0   108   127   NaN
1  122.0   107   112   NaN
2  119.0   103   115   NaN
3  104.0   121   120   NaN
4  117.0   107   118   NaN
5  123.0   122   105   NaN
6  125.0   127   110   NaN
7  105.0   127   107   NaN
8  128.0   104   103   NaN
9  101.0   125   115   NaN

In [134]:
pd.concat([df1,df2], join="inner", ignore_index=True)

    var1  var2
0      9    28
1      8    13
2      4    16
3     22    21
4      8    19
5     23     6
6     28    11
7     28     8
8      5     4
9     26    16
10   108   127
11   107   112
12   103   115
13   121   120
14   107   118
15   122   105
16   127   110
17   127   107
18   104   103
19   125   115

In [135]:
?pd.concat

In [136]:

pd.concat([df1,df2], join_axes = [df2.columns], ignore_index= True)

c:\users\omer\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

    var1  var2   deg3
0      9    28    NaN
1      8    13    NaN
2      4    16    NaN
3     22    21    NaN
4      8    19    NaN
5     23     6    NaN
6     28    11    NaN
7     28     8    NaN
8      5     4    NaN
9     26    16    NaN
10   108   127  126.0
11   107   112  122.0
12   103   115  119.0
13   121   120  104.0
14   107   118  117.0
15   122   105  123.0
16   127   110  125.0
17   127   107  105.0
18   104   103  128.0
19   125   115  101.0

In [137]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [138]:
df2.columns

Index(['var1', 'var2', 'deg3'], dtype='object')

# Concatenation

In [139]:
import pandas as pd

df1 = pd.DataFrame({'Worker':['John','Doe','Mehmet','Jeff'],
                    'Positions':['HR','Engineering','AI','Accounting']
                   })
df1

   Worker    Positions
0    John           HR
1     Doe  Engineering
2  Mehmet           AI
3    Jeff   Accounting

In [140]:
df2 = pd.DataFrame({'Worker':['John','Doe','Mehmet','Jeff'],
                   
                    'Date_Of_starting_work':[2012,'2018','2015','2017']
                   })
df2

   Worker Date_Of_starting_work
0    John                  2012
1     Doe                  2018
2  Mehmet                  2015
3    Jeff                  2017

In [141]:
pd.merge(df1,df2)

   Worker    Positions Date_Of_starting_work
0    John           HR                  2012
1     Doe  Engineering                  2018
2  Mehmet           AI                  2015
3    Jeff   Accounting                  2017

In [142]:
#many to one
df3 = pd.merge(df1,df2, on = "Worker")
df3

   Worker    Positions Date_Of_starting_work
0    John           HR                  2012
1     Doe  Engineering                  2018
2  Mehmet           AI                  2015
3    Jeff   Accounting                  2017

In [143]:
df4 = pd.DataFrame({'Positions':['Accounting',"Engineering",'HR'],
                    'Mudur': ['Caner','Mustafa','Berkcan']
                   })
pd.merge(df3,df4)

  Worker    Positions Date_Of_starting_work    Mudur
0   John           HR                  2012  Berkcan
1    Doe  Engineering                  2018  Mustafa
2   Jeff   Accounting                  2017    Caner

In [144]:
pd.merge(df3,df4)

  Worker    Positions Date_Of_starting_work    Mudur
0   John           HR                  2012  Berkcan
1    Doe  Engineering                  2018  Mustafa
2   Jeff   Accounting                  2017    Caner

In [145]:
#many to many
df5 = pd.DataFrame({'Positions':['Accounting','Accounting',"Engineering","Engineering",'HR','HR'],
                    'Ability': ['Math','Excel','Coding','Linux','Excel','Management']
                   })
    
df5

     Positions     Ability
0   Accounting        Math
1   Accounting       Excel
2  Engineering      Coding
3  Engineering       Linux
4           HR       Excel
5           HR  Management

In [146]:
df1

   Worker    Positions
0    John           HR
1     Doe  Engineering
2  Mehmet           AI
3    Jeff   Accounting

In [147]:
pd.merge(df1,df5)

  Worker    Positions     Ability
0   John           HR       Excel
1   John           HR  Management
2    Doe  Engineering      Coding
3    Doe  Engineering       Linux
4   Jeff   Accounting        Math
5   Jeff   Accounting       Excel

# Aggregation & Grouping


* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [148]:
#seaborn has a lot of dataset in own itself.
import seaborn as sns

In [149]:
?sns.load_dataset

In [150]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [151]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [152]:
df.shape

(1035, 6)

In [153]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [154]:
df["mass"]

0        7.10
1        2.21
2        2.60
3       19.40
4       10.50
        ...
1030      NaN
1031      NaN
1032      NaN
1033      NaN
1034      NaN
Name: mass, Length: 1035, dtype: float64

In [155]:
df['mass'].mean()

2.6381605847953216

In [156]:
import numpy as np

a = df["mass"].mean()
print(a.astype("int32").dtype)
a

int32

2.6381605847953216

In [157]:
df["mass"].count()

513

In [158]:
df["mass"].min()

0.0036

In [159]:
df["mass"].max()

25.0

In [160]:
df["mass"].sum()

1353.37638

In [161]:
df["mass"].std()

3.8186166509616046

In [162]:
#variance
df["mass"].var()

14.58183312700122

In [163]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [164]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [165]:
#missing value
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# GroupBy

In [166]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'veri': [10,11,52,23,43,55]}, columns = ['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [167]:
df.groupby("gruplar")

In [168]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [169]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [170]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [173]:
df.groupby("method").count()

                               number  orbital_period  mass  distance  year
method
Astrometry                          2               2     0         2     2
Eclipse Timing Variations           9               9     2         4     9
Imaging                            38              12     0        32    38
Microlensing                       23               7     0        10    23
Orbital Brightness Modulation       3               3     0         2     3
Pulsar Timing                       5               5     0         1     5
Pulsation Timing Variations         1               1     0         0     1
Radial Velocity                   553             553   510       530   553
Transit                           397             397     1       224   397
Transit Timing Variations           4               3     0         3     4

In [174]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [175]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [176]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# Aggregation

In [177]:
import numpy as np
import pandas as pd
import seaborn as sns

df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'deiken1': [10,23,33,22,11,99],
                   'deiken2':[100,253,333,262,111,969]},
                  columns = ['gruplar','deiken1','deiken2'])
df

  gruplar  deiken1  deiken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [178]:
# aggregate

df.groupby('gruplar').mean()

         deiken1  deiken2
gruplar
A               16        181
B               17        182
C               66        651

In [179]:
df.groupby('gruplar').aggregate([min, np.median, max])

        deiken1            deiken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [180]:
df.groupby('gruplar').aggregate({"deiken1":"min","deiken2": "max"})

         deiken1  deiken2
gruplar
A               10        262
B               11        253
C               33        969

### filter

In [181]:
import numpy as np
import pandas as pd
import seaborn as sns

df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'deiken1': [10,23,33,22,11,99],
                   'deiken2':[100,253,333,262,111,969]},
                  columns = ['gruplar','deiken1','deiken2'])
df

  gruplar  deiken1  deiken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [182]:
def filter_func(x):
    return x["deiken1"].std() > 9

In [183]:
df.groupby("gruplar").std()

         deiken1   deiken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [184]:
df.groupby("gruplar").filter(filter_func)

  gruplar  deiken1  deiken2
2       C         33        333
5       C         99        969

### Transform

In [185]:
import numpy as np
import pandas as pd
import seaborn as sns

df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'deiken1': [10,23,33,22,11,99],
                   'deiken2':[100,253,333,262,111,969]},
                  columns = ['gruplar','deiken1','deiken2'])
df

  gruplar  deiken1  deiken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [186]:
df["deiken1"] * 9

0     90
1    207
2    297
3    198
4     99
5    891
Name: deiken1, dtype: int64

In [187]:
df_a = df.iloc[:,1:3]
df_a

   deiken1  deiken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [188]:
df_a.transform(lambda x : x - x.mean())

   deiken1  deiken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [189]:
df_a.transform(lambda x : (x - x.mean()) / x.std())

   deiken1  deiken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

### Apply

In [190]:
import numpy as np
import pandas as pd
import seaborn as sns

df1 = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                   'deiken1': [10,23,33,22,11,99],
                   'deiken2':[100,253,333,262,111,969]},
                  columns = ['gruplar','deiken1','deiken2'])
df1

  gruplar  deiken1  deiken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [191]:
df1.apply(np.sum)

gruplar      ABCABC
deiken1       198
deiken2      2028
dtype: object

In [192]:
df1.apply(np.mean)

TypeError: ('Could not convert ABCABC to numeric', 'occurred at index gruplar')

In [193]:
df1.groupby("gruplar").apply(np.sum)

        gruplar  deiken1  deiken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [194]:
df1.groupby("gruplar").apply(np.mean)

         deiken1  deiken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

# Pivot Tablolar

In [196]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [197]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [198]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [199]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [200]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [201]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [202]:
titanic.age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [203]:
age = pd.cut(titanic["age"], [0,18,23])
age.head(10)

0    (18.0, 23.0]
1             NaN
2             NaN
3             NaN
4             NaN
5             NaN
6             NaN
7     (0.0, 18.0]
8             NaN
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 23]]

In [206]:
titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 23]  1.000000  1.000000  0.500000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 23]  0.200000  0.076923  0.107143

In [ ]:
#read csv
import pandas as pd
pd.read_csv("ornekcsv.csv", sep = ";" )

In [136]:
#read txt
pd.read_csv("duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [ ]:
#read excel
pd.read_excel("ornekx.xlsx")
pd

In [ ]:
#txt okuma 
tips = pd.read_csv("data.txt")
tips